package com.zero.avaloan.avalongate;

public class PlusText {
    /**
     * 头脑可能会自欺，但梦境永远真实
     *
     * 造梦师的能力：
     * 梦境构筑，梦境潜行
     *
     * 造梦师的业务：
     * 构筑梦境，满足客人在特定场景下的心愿
     * 梦境侵蚀，用来调理精神异常的病人，目前此用途并不成熟
     * 梦境潜行，无知无觉中发觉人内心最深处的秘密
     *
     * 梦境规则：
     * 时间：越是深沉的梦境，时间流逝比真实世界就要快更多
     * 危险：
     * 无论是造梦师还是梦者，意识在梦境中受伤死亡，将对现实中的大脑产生严重伤害
     * 为了能在梦中及时脱出，所有入梦者必须具备自己的提示物，产生巨大的违和感，提示自己身处梦境
     * 遇到绝对危险，可通过提示物，脱离梦境
     * 危险的具体表现：
     * 梦境崩塌：
     * 在构筑的梦境之中，梦者的情绪意识产生巨大波动，将导致梦境崩塌。造梦师与入梦者的意识如果不及时脱离，将产生难以估量的危险后果
     * 梦境崩塌由于触发时机难以捉摸，诱因存在极大的不稳定性，危险系数反而很高
     * 梦境侵蚀：
     * 强行将入梦者意识拉入梦境空间，梦境空间的环境也非造梦师单独构筑，梦境的主体是入梦者的意识。
     * 与梦境构筑相比，梦境侵蚀环境中的入梦者对梦境存在极大的自主权，操控与干涉能力更强。
     * 而且入梦者深沉意识中的的阴暗与梦魇，会突如其来的出现，对造梦师产生突如其来的侵蚀伤害。
     * 多重梦境&梦境迷失：
     * 在梦境空间之中，再次进入更进一步的梦境空间，会有极大概率使入梦者迷失在梦境空间中
     * 当入梦者无法意识到自身身处梦境，自动脱离，意识无法恢复原有的脑波频段，将永远迷失在梦境空间中，成为梦的幽灵
     *
     * 最深沉的线：
     * 10年前，疯狂科学家约瑟夫·乔伊为研究脑科学，在比利时的莱茵·菲尔德孤儿院，非法收容了10多名年幼孤儿，进行脑部实验
     * 当警察攻破他隐藏在孤儿院地下室中的实验室时，仅有7名儿童存活
     * 7名儿童受到了各种非人折磨，大脑都得到了不同程度的异变
     * 萧然，获得了将人的意识带入梦境的能力
     * 山本纯一，获得了教唆催眠的能力
     * Andrea 安德丽娅Sebastian塞巴斯蒂安，获得的是将周围所有人的感情映射在自己脑中的能力
     * 约翰·李，超强的记忆与运算能力
     * 段枫，随意操纵别人记忆的能力
     *
     * 林小溪，是段枫犯案的受害者，被侵害之后感到自己的不洁，选择自尽
     * 坠楼之后奇迹生还，成为了破获段枫案件的唯一生还者
     * 为了获得线索，萧然决定将林小溪的意识带入梦境，进行了一次前所未有的长达1年的梦境潜行
     *
     * 人物：
     * 警队：
     * 萧寒，萧然的哥哥，提示物为香烟
     * 形象是个香烟不断邋遢粗俗的警察，并且不断向萧然索取金钱
     * 林小溪不喜欢萧寒，却不知道萧寒深爱着自己的弟弟，费心尽力不让萧然迷失在梦境之中
     *
     * 白羽柔，萧然青梅竹马的姐姐，林小溪的老师
     * 同时也是云城市第一医院的脑科主任
     * 和萧然是日久生情的相爱，但是两人都不愿意明说，若即若离
     *
     * 林小溪：
     * 21岁，大学生，云城医学院脑科毕业生
     * 原本是立志成为造梦师，努力毕业就业的美丽少女
     * 父母之前经商，疏于关爱，却家教很严，努力追求着经济和思想的独立
     * 从小由于受过苦难，对于别人的困苦异常敏感
     * 是个心地细腻善良、富有爱心的女孩
     * 中学时期被排挤，却是一个外热内冷，对别人不愿意敞开心胸的封闭少女
     * 愿意帮助别人，却不愿打开自己的心门
     * 由于无法通过学校统一设置的心理评估，成绩优异的林小溪无法顺利肄业，
     * 除非在实习一年后，获得一位在职造梦师的肯定，才能顺利毕业
     * 白雨柔推荐
     *
     *
     * 故事大体流程
     *
     *
     *
     *
     * */


























}
