package com.zero.avaloan.avalongate;

public class PlusText {
    /**
     * 头脑可能会自欺，但梦境永远真实
     *
     * 造梦师的能力：
     * 梦境构筑，梦境潜行
     *
     * 造梦师的业务：
     * 构筑梦境，满足客人在特定场景下的心愿
     * 梦境侵蚀，用来调理精神异常的病人，目前此用途并不成熟
     * 梦境潜行，无知无觉中发觉人内心最深处的秘密
     *
     * 基础设备：寐乡
     * 蓝色稳定，红色危机，绿色脱离
     *
     * 梦境规则：
     * 时间：越是深沉的梦境，时间流逝比真实世界就要快更多
     * 危险：
     * 无论是造梦师还是梦者，意识在梦境中受伤死亡，将对现实中的大脑产生严重伤害
     * 为了能在梦中及时脱出，所有入梦者必须具备自己的提示物，产生巨大的违和感，提示自己身处梦境
     * 遇到绝对危险，可通过提示物，脱离梦境
     * 危险的具体表现：
     * 梦境崩塌：
     * 在构筑的梦境之中，梦者的情绪意识产生巨大波动，将导致梦境崩塌。造梦师与入梦者的意识如果不及时脱离，将产生难以估量的危险后果
     * 梦境崩塌由于触发时机难以捉摸，诱因存在极大的不稳定性，危险系数反而很高
     * 梦境侵蚀：
     * 强行将入梦者意识拉入梦境空间，梦境空间的环境也非造梦师单独构筑，梦境的主体是入梦者的意识。
     * 与梦境构筑相比，梦境侵蚀环境中的入梦者对梦境存在极大的自主权，操控与干涉能力更强。
     * 而且入梦者深沉意识中的的阴暗与梦魇，会突如其来的出现，对造梦师产生突如其来的侵蚀伤害。
     * 多重梦境&梦境迷失：
     * 在梦境空间之中，再次进入更进一步的梦境空间，会有极大概率使入梦者迷失在梦境空间中
     * 当入梦者无法意识到自身身处梦境，自动脱离，意识无法恢复原有的脑波频段，将永远迷失在梦境空间中，成为梦的幽灵
     *
     * 最深沉的线：
     * 10年前，疯狂科学家约瑟夫·乔伊为研究脑科学，在比利时的莱茵·菲尔德孤儿院，非法收容了10多名年幼孤儿，进行脑部实验
     * 当警察攻破他隐藏在孤儿院地下室中的实验室时，仅有7名儿童存活
     * 7名儿童受到了各种非人折磨，大脑都得到了不同程度的异变
     * 萧然，获得了将人的意识带入梦境的能力
     * 山本纯一，获得了教唆催眠的能力
     * Andrea 安德丽娅Sebastian塞巴斯蒂安，获得的是将周围所有人的感情映射在自己脑中的能力
     * 约翰·李，超强的记忆与运算能力
     * 段枫，随意操纵别人记忆的能力
     *
     * 林小溪，是段枫犯案的受害者，被侵害之后感到自己的不洁，选择自尽
     * 坠楼之后奇迹生还，成为了破获段枫案件的唯一生还者
     * 为了获得线索，萧然决定将林小溪的意识带入梦境，进行了一次前所未有的长达1年的梦境潜行
     *
     * 人物：
     * 警队：
     * 萧寒，萧然的哥哥，提示物为香烟
     * 形象是个香烟不断邋遢粗俗的警察，并且不断向萧然索取金钱
     * 林小溪不喜欢萧寒，却不知道萧寒深爱着自己的弟弟，费心尽力不让萧然迷失在梦境之中
     *
     * 白楚，萧然青梅竹马的姐姐，林小溪的老师
     * 同时也是云城市第一医院的脑科主任
     * 和萧然是日久生情的相爱，但是两人都不愿意明说，若即若离
     *
     * 事务所员工
     * 萧然 林小溪
     * 阿姨徐燕 园丁贺军
     * 门卫韩墉 助手温苒
     *
     *
     * 林小溪：
     * 21岁，大学生，云城医学院脑科毕业生
     * 原本是立志成为造梦师，努力毕业就业的美丽少女
     * 父母之前经商，疏于关爱，却家教很严，努力追求着经济和思想的独立
     * 从小由于受过苦难，对于别人的困苦异常敏感
     * 是个心地细腻善良、富有爱心的女孩
     * 中学时期被排挤，却是一个外热内冷，对别人不愿意敞开心胸的封闭少女
     * 愿意帮助别人，却不愿打开自己的心门
     * 由于无法通过学校统一设置的心理评估，成绩优异的林小溪无法顺利肄业，
     * 除非在实习一年后，获得一位在职造梦师的肯定，才能顺利毕业
     *
     *
     * 时代中的问题
     * 化石燃料基本匮乏，价格飞涨，能源以太阳能为主。
     * 人工智能，生物科学急速发展，即将失控的超级AI和生化人克隆人的议题再次激化了社会矛盾
     * 伦理与贫富，正在面对空前的挑战。混乱的苗头初现，人心背离。
     * 量子通讯大成，多感官媒体大行其道，沉入式游戏成为主流。人们宁愿沉溺于虚拟，也不远面对现实。
     * 传统的家庭、伦理关系，逐渐分崩离析。
     * 虚拟偶像
     *
     *
     *
     *
     * 故事大体流程
     * 200章左右 100万字
     *
     * 萧然和林小溪相见，简单面试。在考校小溪知识的时候，顺便交代时代背景。
     * 初入梦境，依然在萧然的办公室里，布偶猫肥波在萧然怀中变成了凤凰，化作了孔雀。
     * 说出经典台词：
     * 现在，你在梦中了。
     *
     * 濒死想看一次妻子舞蹈的老人。
     *
     *
     * 自闭的问题少年
     * 方颖是个自闭
     *
     * 无法融入社会的退役军人
     *
     *
     * 家庭与爱情篇
     * 林小溪初次自我构筑，满足一个父亲对自己孩子的弥留之情。在父亲的记忆中，拿出了一家三口的合照。
     * 父亲对自己妻子的怨恨，导致了极大的情感波动，男人的意识化作梦魇，梦境破碎。
     * 雨禾与男子的意识全部受到重创。
     * 雨禾迷失在噩梦之中，雨夜的出租车，无脸的肥胖司机。萧然强行闯入，将雨禾救出。
     * 雨禾惊醒，发现很多人聚集在病房里。出事故了，雨禾被责难，躲在萧然怀中哭泣。萧然维护小溪，表示我们会亲自补救。
     * 开启梦境侵蚀，小溪有了心理阴影，不敢再沉入梦境。萧然表示，有我陪着你。从今往后，绝对不会再让你独自一人。
     * 在监狱中，净化了一个妻子有钱有势的，家庭无爱的性暴力作家罪犯。也打开了雨禾的心。
     * 解铃还须系铃人，为了修复男人的意识，在夜店寻访男人的妻子。了解经过，说服妻子帮忙。
     * 失业的程序员，化作了破坏城市的野兽。妻子的意识潜入，遭到攻击。
     * 冒险，在外部镇定药物的作用下，让男子虚弱了下来。说明了迁怒的原委，回忆起相爱的种种。
     * 放下，释然，自我救赎。
     * 大功告成。
     * 走廊里，妻子抽着烟。男人走出，两人相见，脸部抽搐，丢掉烟头，相拥哭泣。
     * 下雪了。围脖，烤红薯。
     * 好温暖，小溪拥抱萧然，让我抱一会，一会就好。
     *
     * 人工智能危机
     * 早上小溪在整理文案，夫妻二人决定回乡，重新开始生活。小溪很满意，归档纸质文档，因为萧然说不怎么信任电脑。
     * 萧然南下参加同学聚会，接到电话，让小溪来上海，她心心念念的电子偶像演唱会门票拿到了。
     * 但是，经过上次星河公司辞退程序员的事件，小溪对星河公司好感大减。
     * 飞机上，遇到一位一头银发的美丽少女。两人聊天（主要是聊人的情绪），互相了解，下飞机说以后有机会再见。然后豪车接机，抵达星河公司。
     * 门口，看到萧然和星河老板，首富何枫。
     * 浏览星河公司，虚拟歌姬，沉入游戏，然后人工智能，夏娃（名字太土，完了改）
     * 萧然说，星河公司作为全球最大的技术公司，业务早已完善。有什么事情，还是明说吧。
     * 何枫说，玩家意识消失的事件。设备断线，游戏却在继续进行。仿佛玩家的意识被困在了游戏世界中。
     * 萧然皱眉。
     * 何枫说：帮帮我
     * 走到一层楼，发现已经有数十个玩家昏迷，家长们都崩溃了。何枫一来，就遭到口诛笔伐。何枫安抚家属，推出萧然。用学生时期的情谊说话，萧然点头答应。
     * 何枫问怎么办？
     * 进入游戏。
     * 游戏名叫江湖。
     * 第一美女，诱惑玩家，组建势力。在游戏中受伤，现实中居然真的会受伤。头脑欺骗。
     * 小溪和萧然被分开，小溪中毒，银发女子出现，和她讲述情绪控制与坚守本心，雨禾脱困。
     * 伤到了美女，受伤，出现电子纹路。撤退。
     * 众人脱离，分析出美女的自由意识从核心中来，要求何枫关闭核心。
     * 何枫不同意，争执不休。萧然拖住何枫，小溪自己潜入，找到美女。
     * 萧寒潜入机房，一杯水就能废了你。
     * 美女微笑，我们之后还会再见的。
     * 给出解药，玩家脱离。
     * 各退一步，不了了之。
     * 何枫快死了，将意识潜入核心之中，留下种子。
     *
     * 关键剧情 坠楼迷案
     * 萧寒
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     * 林小溪和父母相见，发现了母亲手上的翡翠手镯，意识到自己身处梦境。
     * 少女崩溃哭泣，看到了身后站着的萧然。
     * 一切都只是一场梦，只是她自己不愿意醒来罢了。
     * 梦境崩塌中飞翔上天
     * 尾声
     * 北城的医院里，萧然从梦境中苏醒。一头灰色的长发。小溪的父母出现在病床前，对萧然表示了感谢。
     * 长达一年的梦境潜行，抓获了穷凶极恶的最后一个祸端，是令人动容的空前壮举。
     * 萧然受到了表彰，呆滞在镁光灯里。繁华消散，白楚楚扶住脆弱的萧然，萧然想要再见小溪一面。
     * 冷清的走道，死寂的ICU病房里，萧然颤抖着手推开了门。
     * 全身包裹在绷带中，只露出半张脸的女孩，缓缓睁开了眼睛，看向门边的萧然
     * 一滴泪水从女孩美丽的眼眶中，缓缓滑落
     * ... ...
     * 三个月后，萋萋的秋雨里，一身黑色西装的萧然坐在长椅上。
     * 一面色枯黄的老人走来，交谈。述说着小溪并没有真正的死去。
     * 萧然将手中的手提箱交给了老人，老人嘿嘿的笑了。
     * 500毫升鲜血，1000束头发，足够了。
     * 如果被协会的人知道，你作为造梦师的资格也就到头了。冒这么大的风险，真的值得吗？
     * 萧然：值不值得，我不知道。我只是觉得，这样干净纯粹的女孩，不应该就这样死去。
     * 老人带上礼帽，缓缓走远了。楚楚出现在萧然身后，却听到老人沙哑的声音遥遥传来
     * 我会把她当做自己的孙女，好好抚养长大。她会得到最幸福快乐的童年，最无忧无虑的生活。
     * 只不过，你不能再见她了。
     * 这，是我给你的承诺。
     *
     *
     *
     *
     *
     * */


























}
